{
    "Q1": {
        "text": "Calculate the magnitude of the magnetic field at a distance of 10 cm from a long straight wire carrying 20 A.",
        "unit": "G (Gauss)",
        "answer": 0.399988
    },
    "Q2": {
        "text": "A circular loop of radius 15 cm carries 5 A. Determine the magnetic field at the center.",
        "unit": "G (Gauss)",
        "answer": 0.209433
    },
    "Q3": {
        "text": "Compute the magnetic field inside a 50 cm long solenoid with 500 turns carrying 2 A.",
        "unit": "G (Gauss)",
        "answer": 25.132
    },
    "Q4a": {
        "text": "A proton moves at 1e6 m/s perpendicularly into a 1 μT magnetic field. Calculate the radius of its circular path.",
        "unit": "cm",
        "answer": 1.04408
    },
    "Q5a": {
        "text": "Pb²⁺ ion passes 5 cm from a long wire carrying 10 A. Calculate the magnetic field at its location.",
        "unit": "G (Gauss)",
        "answer": 4e-01
    },
    "Q5b": {
        "text": "Determine the magnitude of the force on the Pb²⁺ ion moving at 200 m/s.",
        "unit": "N",
        "answer": 2.56e-21
    },
    "Q6a": {
        "text": "Two parallel wires 3 cm apart carry 8 A and 12 A. Compute the force on a 30 cm segment.",
        "unit": "\u+03bc N",
        "answer": 0.000192e+06
    },
    "Q7b": {
        "text": "Determine the net magnetic field at the center of a solenoid and ring carrying opposite-direction currents.",
        "unit": "G (Gauss)",
        "answer": 0.0001e+4
    },
    "Q8": {
        "text": "A 0.5 m wire with 6 A in a 100 μT B field (into page). Find the magnetic force magnitude.",
        "unit": "mN",
        "answer": 0.0003e+3
    },
    "Q9a": {
        "text": "What current is needed in a 250-turn, 0.5 m solenoid to produce 40 μT field?",
        "unit": "A",
        "answer": 0.796
    },
    "Q9b": {
        "text": "What current is needed in a 0.2 m radius ring to produce 40 μT field at center?",
        "unit": "A",
        "answer": 1.257
    },
    "Q10a": {
        "text": "Estimate the solenoid’s B-field and field at 1 cm from the straight wire (5 A).",
        "unit": "G (Gauss)",
        "answer": 0.00136e+4
    },
    "Q10b": {
        "text": "Calculate force per unit length on a wire (5 A) in solenoid’s B-field.",
        "unit": "mN/m",
        "answer": 0.0063e+03
    }
}
